# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [65]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [66]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [67]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [68]:
del baby_names["Unnamed: 0"]
del baby_names["Id"]
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [69]:
baby_names.groupby("Gender").Count.sum()

Gender
F    16380293
M    19041199
Name: Count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [70]:
del baby_names["Year"]
del baby_names["Gender"]
del baby_names["State"]

names = baby_names.groupby("Name").sum()
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

### Step 8. How many different names exist in the dataset?

In [73]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [76]:
names.sort_values(by="Count",ascending=False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

### Step 10. How many different names have the least occurrences?

In [77]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [79]:
names.median()

Count    49.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [82]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [81]:
names.describe().T

         count         mean           std  min   25%   50%    75%       max
Count  17632.0  2008.932169  11006.069468  5.0  11.0  49.0  337.0  242874.0